## Production: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 5 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                      NAME                                       |
|--------|---------------------------------------------------------------------------------|
| add    | `aws_athena_data_catalog.dynamodb`                                              |
|        | `aws_s3_bucket.athena_spill_bucket`                                             |
|        | `aws_s3_bucket_lifecycle_configuration.athena_spill_bucket`                     |
|        | `aws_s3_bucket_public_access_block.athena_spill_bucket`                         |
|        | `aws_serverlessapplicationrepository_cloudformation_stack.dynamodb_connector`   |
| delete | `aws_cloudwatch_metric_alarm.healthcheck_lambda_submission_invocations_anomaly` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_function.existing will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_function" "existing" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_signing_config_arn        = (known after apply)
      + dead_letter_config             = (known after apply)
      + description                    = (known after apply)
      + environment                    = (known after apply)
      + ephemeral_storage              = (known after apply)
      + file_system_config             = (known after apply)
      + function_name                  = "dynamodb-lambda-connector"
      + handler                        = (known after apply)
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + kms_key_arn                    = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + logging_config                 = (known after apply)
      + memory_size                    = (known after apply)
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = (known after apply)
      + role                           = (known after apply)
      + runtime                        = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = (known after apply)
      + timeout                        = (known after apply)
      + tracing_config                 = (known after apply)
      + version                        = (known after apply)
      + vpc_config                     = (known after apply)
    }

  # aws_athena_data_catalog.dynamodb will be created
  + resource "aws_athena_data_catalog" "dynamodb" {
      + arn         = (known after apply)
      + description = "Athena dynamodb data catalog"
      + id          = (known after apply)
      + name        = "dynamodb"
      + parameters  = (known after apply)
      + tags_all    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + type        = "LAMBDA"
    }

  # aws_cloudwatch_metric_alarm.healthcheck_lambda_submission_invocations_anomaly will be destroyed
  # (because aws_cloudwatch_metric_alarm.healthcheck_lambda_submission_invocations_anomaly is not in configuration)
  - resource "aws_cloudwatch_metric_alarm" "healthcheck_lambda_submission_invocations_anomaly" {
      - actions_enabled           = true -> null
      - alarm_actions             = [] -> null
      - alarm_description         = "HealthCheck - `submission` invocations in 30 minutes is low." -> null
      - alarm_name                = "SubmissionLambdaInvocationsAnomaly" -> null
      - arn                       = "arn:aws:cloudwatch:ca-central-1:957818836222:alarm:SubmissionLambdaInvocationsAnomaly" -> null
      - comparison_operator       = "LessThanLowerThreshold" -> null
      - datapoints_to_alarm       = 0 -> null
      - dimensions                = {} -> null
      - evaluation_periods        = 1 -> null
      - id                        = "SubmissionLambdaInvocationsAnomaly" -> null
      - insufficient_data_actions = [] -> null
      - ok_actions                = [] -> null
      - period                    = 0 -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "CostCentre" = "forms-platform-production"
          - "Terraform"  = "true"
        } -> null
      - threshold                 = 0 -> null
      - threshold_metric_id       = "invocations_expected" -> null
      - treat_missing_data        = "notBreaching" -> null

      - metric_query {
          - id          = "invocations" -> null
          - period      = 0 -> null
          - return_data = true -> null

          - metric {
              - dimensions  = {
                  - "FunctionName" = "Submission"
                } -> null
              - metric_name = "Invocations" -> null
              - namespace   = "AWS/Lambda" -> null
              - period      = 1800 -> null
              - stat        = "Sum" -> null
              - unit        = "Count" -> null
            }
        }
      - metric_query {
          - expression  = "ANOMALY_DETECTION_BAND(invocations)" -> null
          - id          = "invocations_expected" -> null
          - label       = "Invocations (expected)" -> null
          - period      = 0 -> null
          - return_data = true -> null
        }
    }

  # aws_s3_bucket.athena_spill_bucket will be created
  + resource "aws_s3_bucket" "athena_spill_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "gc-forms-production-athena-spill-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.athena_spill_bucket will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "athena_spill_bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + id     = "Clear spill bucket after 1 day"
          + status = "Enabled"

          + expiration {
              + days                         = 1
              + expired_object_delete_marker = (known after apply)
            }
        }
    }

  # aws_s3_bucket_public_access_block.athena_spill_bucket will be created
  + resource "aws_s3_bucket_public_access_block" "athena_spill_bucket" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_serverlessapplicationrepository_cloudformation_stack.dynamodb_connector will be created
  + resource "aws_serverlessapplicationrepository_cloudformation_stack" "dynamodb_connector" {
      + application_id   = "arn:aws:serverlessrepo:us-east-1:292517598671:applications/AthenaDynamoDBConnector"
      + capabilities     = [
          + "CAPABILITY_IAM",
          + "CAPABILITY_RESOURCE_POLICY",
        ]
      + id               = (known after apply)
      + name             = "dynamodb-connector"
      + outputs          = (known after apply)
      + parameters       = (known after apply)
      + semantic_version = (known after apply)
      + tags_all         = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

Plan: 5 to add, 0 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_data_catalog.dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.codedeploy_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ELB_5xx_error_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup1"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.UnHealthyHostCount-TargetGroup2"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.audit_log_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_login_outside_canada_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_signin_exceeded"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_forms_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_form_archiver_invocations"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_nagware_invocations_schedule"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_response_archiver_invocations"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.healthcheck_lambda_submission_invocations_core_hours"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
